numbers = [1, 3, 5, 7, 9]   #შევქმენით სია
num = [2, 4, 6, 8, 10]       #გავაკეთეთ მოერე სია

sum = 0  #შევადგინეთ ჯამი პირველი სიისთვის
for i in numbers:  #აქ ვწერთ რიცხვებს რომელიც მოცემულია პირველ სიაში
    sum += i      #ვიანგარიშეთ პირველ სიაში მოცემული რიცხვების ჯმი

sum1 = 0      #შევადგინეთ ჯამი მეორე სიისთვის
for i in num:  #აქ ვწერთ რიცხვებს რომელიც მოცემულია მეორე სიაში
    sum1 += i    #ვიანგარიშეთ მეორე სიაში მოცემული რიცხვების ჯმი

multiple = sum * sum1    #ვამრავლებთ ორივე სიის ჯამებს
print(multiple)    #ეკრანზე გამოგვაქ ნამრავლი