// 3. შექმენით ცვლადები let-ით const-ით და var-ით და კომენტარის სახით განმარტეთ თითოეული მათგანი. კონსოლში გამოიტანეთ ამ ცვლადის მნიშვნელობები

let g = "Goal"         // let არის ცვლადის შემქმნელი, ოღონდ მისი განაახლება არ შეგვიძლია
const o = "oriented"   // const არის ცვლადის შემქმნელი, ოღონდ მისი განაახლება არ შეგვიძლია
var a = "academy"      // var იც ცვლადის შემქმნელია. იგი ყველაფრით let ს გავს. ოღონდ განსხვავება მარტო ისაა, რომ let უფრო ახალი ვერსიაა და var შედარებით ძველი და კიდევ ის, რომ მისი განაახლება შეგვიძლია
console.log(g)
console.log(o)
console.log(a)