// 1. კომემტარის სახით ახსენით რა არის querySelector, querySelectorAll. განსხვავება მათ შორის და შეადარეთ სხვებსაც.

// querySelector არის სელექტორი, რომლის საშუალებითაც შეგვიძლია წამოვიღოთ პირველი ელემენტი html დოკუმენტიდან, რომელიც შეესაბამება ჩვენ მიერ მითითებულ თეგს, ან კლასს.
// querySelectorAll არის სელექტორი, რომლის საშუალებითაც შეგვიძლია წამოვიღოთ ელემენტები html დოკუმენტიდან, რომლებიც შეესაბამებიან ჩვენს მიერ მითითებულ თეგს, ან კლასს.
// განსხვავება ამ ორ სელექტორ შორის ის არის, რომ querySelector ის საშუალებით მხოლოდ პირველი ელემენტი გადმოგვაქვს, ხოლო querySelectorAll კი ყველა.
// querySelector განსხვავდება სხვა დანარჩენი სელექტორებისგან, რადგან მას მხოლოდ ერთი, პირველი ელემნტი გადმოაქვს. ხოლო querySelectorAll კი ძალიან წააგავს სხვებს, რადგან მას ყველა ელემენტი გადმოაქვს თეგის, კლასის, ან აიდის მიხედვით.