/*1)შექმენი ერთი სია,სადაც მოათავსებთ განსხვავებული ტიპის ელემენტებს,5 ზე მეტი ელემენტი იყოს სიაში

---გამოიტანეთ სიის თითოეული ელემენტი ცალ ცალკე

---გამოიტანე სიის თითოეული ელემენტი for loop ის გამოყენებით

---გამოიტანე სიის თითოეული ელემენტი while loop ის გამოყენებით
*/

let array = [1, true, "wefw", 3.1, ["qef"], 3]

console.log(array[0])
console.log(array[1])
console.log(array[2])
console.log(array[3])
console.log(array[4])
console.log(array[5])

// -------------------------------------------------------------------------------------

for(let i = 0;i < 6;i++) {
    console.log(array[i])
}

// -------------------------------------------------------------------------------------

let ii = 0

while(ii < 6) {
    console.log(array[ii])
    ii++
}