#3 ) გააკეთეთ sandwith_make ფუნქცია რომელების არგუმენტების დახმარებით გააკეთებთ თქვენს ბუტერბროდი

def sandwitch_make():
    print("დაგვჭირდება: 2 ნაჭერი პური, რა წასასმელიც გვინდა(კარაქი, თაფლი ა.შ), შესავსები(ხორცი, ყველის ნაჭერი და ა.შ). შეგვიძლია ასევე  დავამატოთ:პომიდორი, კიტრი ან სხვ.")

    print("მოამზადეთ პური: დადეთ პურის ნაჭრები ბრტყელ ზედაპირზე სპრედი: დამატებითი არომატისთვის წაუსვით კარაქი, მაიონეზი ან მდოგვი პურის ერთ ან ორივე ნაჭერზე. შიგთავსის დამატება: პურის ერთ ნაჭერზე მოათავსეთ თქვენი ძირითადი შიგთავსი (მაგ. დაჭრილი ყველი, ლორი ან ინდაური).დაამატეთ ბოსტნეული (სურვილისამებრ): მოაყარეთ სალათის ფოთოლი, პომიდვრის ნაჭრები ან თქვენთვის სასურველი ნებისმიერი ბოსტნეული. დახურეთ სენდვიჩი: ზემოდან მოათავსეთ პურის მეორე ნაჭერი. გაჭერით და მიირთვით: სენდვიჩი გაჭერით შუაზე ან სურვილისამებრ მეოთხედ. მიირთვით როგორც არის ან ჩიფსების ან ხილის გვერდით.")

sandwitch_make()