# 1)შექმენი ცვლადი სადაც შეინახავ ამ წინადადებას --> "hello*world*i*am*goga" , თქვენი დავალებაა ამ სტრინგიდან მიიღოთ სია სადაც გექნებათ ამ სტრინგში მოცემული თითოეული სიტყვა,გამოიყენეთ split ფუნქცია და სტრინგი გასპლიტეთ შესაბამის სიმბოლოზე

txt = "hello*world*i*am*goga"
a= txt.split("*")
print(a)

# 2)შექმენი ცვლადი სადაც შეინახავ ერთ დიდ სტრინგს სადაც იქნება რამოდენიმე სიტყვა სპეიცებით გამოყოფილი,თქვენი დავალებაა გასპლიტოთ ეს სტრინგი შესაბამის სიმბოლოზე რომ მიიღთ სია სადაც გექნებათ თითოეული სიტყვა შენახული 

str = "Hello how are you doing today"
list = str.split()
print(list)

# 3)შექმენით ცვლადი სადაც შეინახავთ წინადადებას,შენი დავალებააა ეს წინადადება აქციო სიად სა ამ სიში გექნება ყველა ელემენტი ამ წინადადებიდან და შემდეგ ეს სია გადააქციო ისევ სტრინგად სადაც ელემენტები გამოყოფილები იქნებიან ერთმანეთისგან სფეისებით

text = "What a good day"
list = text.split()
print(list)
string = " ".join(list)
print(string)