#სწორი ცვლადის სახელია:
_var_name = 1
#ეს ცვლადის სახელი იმიტომ არის სწორი, რომ მასში არაა დაშორება(space), მისი პირველი სიმბოლო არ არის რიცხვი(1,2,3,4...)

#არასწორი ცვლადის სახელებია:
#2nd_var. ამ ცვლადის სახელი იმიტომ არის არასწორი, რომ მისი პირველი სიმბოლოა რიცხვი, 2
#var-name. ამ ცვლადის სახელი იმიტომ არის არასწორი, რომ მისი ერთერთი სიმბოლო _ ის ნაცვლას - არის
#var name. ამ ცვლადის სახელი იმიტომ არის არასწორი, რომ აქ არის გამოყენებული დაშორება(space), რომელიც არასწორია და შეგვიძლია ჩავანაცვლოთ _ თი 