"""
lists ახსნა: lists(იგივე სიები ქართულად) გამოიყენება რამდენიმე ელემენტის ერთ ცვლადში შესანახად.
lists არის ერთ-ერთი 4 ჩაშენებული მონაცემთა ტიპიდან Python-ში, რომელიც გამოიყენება მონაცემთა კოლექციების შესანახად, დანარჩენი 3 არის Tuple, Set და Dictionary, ყველა განსხვავებული ხარისხისა და გამოყენების.
lists იქმნება კვადრატული ფრჩხილების გამოყენებით

მაგალითად:
"""
list = ["apple", "banana", "peach", "pineaple", "cherry"]
print(list)


"""
tuples ახსნა: Tuples გამოიყენება რამდენიმე ელემენტის ერთ ცვლადში შესანახად.
Tuple არის ერთ-ერთი 4 ჩაშენებული მონაცემთა ტიპიდან Python-ში, რომელიც გამოიყენება მონაცემთა კოლექციების შესანახად, დანარჩენი 3 არის Lists, Set და Dictionary, ყველა განსხვავებული ხარისხისა და გამოყენების.
Tuples არის შეკვეთილი და უცვლელი კოლექცია.
Tuples იწერება მრგვალი ფრჩხილებით

მაგალითად:
"""
tuple = ("apple", "banana", "cherry")
print(tuple)
