/* 2. შექმენით ფუნქცია, რომელსაც გადაეცემა თქვენი სახელი და ასაკი, და დააბრუნეთ ტექსტი 'გამარჯობა, მე ვარ {სახელი}, და ვარ {ასაკი} წლის. შენ რამდენის ხარ? '

ფუნქციას რომ შექმნით გამოიძახეთ 3-ჯერ, კონსოლში გამოჩნდეს შედეგი და სხვადასხვა მნიშვნელობა გადაეცით
*/

function nameage(name, age) {
    return "გამარჯობა, მე ვარ" + " " + name + " " + "და ვარ" + " " + age + " " + "წლის. შენ რამდენის ხარ?"
}

console.log(nameage("Aleqsandre", 13))
console.log(nameage("Datuna", 14))
console.log(nameage("Andria", 15))