/* 5. შექმენი პროგრამა, სადაც მომხმარებელი შეიყვანს რიცხვს. ეს რიცხვი იქნება პაროლი. პროგრამამ უნდა დაითვალოს რამდენად ძლიერია მომხმარებლის მიერ შეყვანილი პაროლი. და შეამოწმოს ნამდვილად რიცხვი არის თუ არა.
     1  . თუ შეყვანილი სიმბოლოების რაოდენობა მეტია ან ტოლი 6-ზე მაშინ +10  ქულა. თუ 3-6 შუალედშია სიმბოლოების რაოდენობა მაშინ 5 ქულა. სხვა შემთხვევაში 0.
     2 . თუ ამ რიცხვის ციფრთა ჯამი მეტია 20-ზე მაშინ + 10 ქულა. თუ 15-20 შუალედშია მაშინ 5 ქულა. სხვა შემთხვევაში 0 ქულა. 
თუ ქულების საერთო ჯამი მეტი იქნება 15-ზე მაშინ დააბრუნეთ რომ "პაროლი არის ძლიერი". თუ 10-დან 15-მდეა მაშინ "საშუალო სირთულის" სხვა შემთხვევაში დააბრუნეთ "პაროლი სუსტია". (string-ად არ გადააქციოთ ეს რიცხვი და ისე არ გაიგთ ციფრთა ჯამი ან სიგრძე. გამოიყენეთ Math ობიექტი )
*/

let userNum = Number(prompt("Enter any number as your password:"))
let point = 0

if(userNum >= 100000) {
     point += 10
}
else if(userNum >= 100 && userNum < 100000) {
     point += 5
}
else {
     point += 0
}

let sum = 0
while(userNum > 0) {
     sum += userNum % 10
     userNum = Math.floor(userNum / 10)
}

if(sum >= 20) {
     point += 10
}
else if(sum >= 15 && sum < 20) {
     point += 5
}
else {
     point += 0
}

if(point >= 15) {
     console.log("პაროლი არის ძლიერი")
}
else if(point > 10 && point < 15) {
     console.log("საშუალო სირთულის")
}
else {
     console.log("პაროლი სუსტია")
}